Repository: DIKO-Doc/DIKO-Doc.github.io
Catalog: cht-to-eng/cht-to-eng-omegat.tmx
Source language: zh_tw
Languages: en

source: Use multiply add/subtract instructions
en: 使用乘加/減指令

source: Use native format for unformatted files
en: 使用原生格式於未格式的檔案

source: Use new mnemonics for PowerPC architecture
en: 為 PowerPC 架構使用新的助憶符號

source: Use normal calling convention
en: 使用一般的呼叫約定

source: Use offset tables for virtual method calls
en: 為虛方法呼叫使用偏移表

source: Use old mnemonics for PowerPC architecture
en: 為 PowerPC 架構使用舊的助憶符號

source: Use online suggestions
en: Yus onlain sùjjesçions

source: Use only one TOC entry per procedure
en: 為每個程序只使用一個 TOC 條目

source: Use packed stack layout
en: 使用緊實的堆疊版面設置

source: Use paired-single floating-point instructions
en: 使用配對的單精度浮點指令

source: Use point-to-point encryption (MPPE)
en: 使用點對點加密（MPPE）

source: Use portable calling conventions
en: 使用一般的呼叫約定

source: Use profiling information for branch probabilities
en: 為分支概率使用取樣資訊

source: Use push instructions to save outgoing arguments
en: 使用 push 指令儲存參數

source: Use red-zone in the x86-64 code
en: 在 x86-64 程式碼中使用紅區

source: Use register stack for parameters and return value
en: 使用暫存器堆疊傳遞參數和回傳值

source: Use registers for argument passing
en: 使用暫存器傳遞參數

source: Use registers r2 and r5
en: 使用暫存器 r2 和 r5

source: Use s_yntax highlighting
en: 使用語法標示(_Y)

source: Use shallow comparison
en: 使用粗淺比對

source: Use shared libraries
en: 使用共享函式庫

source: Use software floating point
en: 使用軟體浮點單元

source: Use stack bias
en: 使用堆疊偏移

source: Use stateful MPPE
en: 使用有狀態MPPE

source: Use stubs for function prologues
en: 使用占位程式完成函式前言/尾聲

source: Use suggestions from online collaborative TM
en: Yus sùjjesçions from onlain kollaboreitiv TM

source: Use the Cray Pointer extension
en: 使用 Cray 指標擴充

source: Use the DEC assembler syntax
en: 使用 DEC 組譯風格

source: Use the divide instruction
en: 使用除法指令

source: Use the narrowest integer type possible for enumeration types
en: 為列舉類型使用盡可能窄的整數類型

source: Use the same size for double as for float
en: 令 double 使用 float 的大小

source: Use the system default editor
en: 使用系統預設編輯器

source: Use the system default monospace font
en: 使用系統預設等寬字型

source: Use translation memory
en: Yus transleiçion memori

source: Use zero-extending memory loads, not sign-extending ones
en: 使用零擴充而不是符號擴充的記憶體載入

source: Used by GtkSourceView to determine colors for syntax highlighting
en: GtkSourceView 用來判斷語法標示的顏色

source: Used in Fix-and-Continue mode to indicate that object files may be swapped in at runtime
en: 指定物件檔案可能在執行時被換入以允許「修復並繼續」除錯模式

source: User settings
en: 用戶設置

source: Username
en: 使用者名稱

source: Username used to authenticate with the ADSL service.
en: 用於通過ADSL服務進行身份驗證的用戶名。

source: Username used to authenticate with the PPPoE service.
en: 用於通過PPPoE服務進行身份驗證的用戶名。

source: Using built-in specs.
en: 使用內建 specs。

source: VCI of ADSL connection
en: ADSL連接的VCI

source: VF with index %u, but the total number of VFs is %u
en: 帶索引的VF %u, 但是VF的總數是 %u

source: VFs %d and %d are not sorted by ascending index
en: 多個VF %d 和 %d 不按升序索引排序

source: VLAN connection %d
en: VLAN 連線 %d

source: VPI of ADSL connection
en: ADSL連接的VPI

source: VPN connected
en: VPN 已連線

source: VPN connecting
en: VPN 連線

source: VPN connecting (getting IP configuration)
en: VPN 連線（取得 IP 配置）

source: VPN connecting (need authentication)
en: VPN 連線（需要身份認證）

source: VPN connecting (prepare)
en: VPN 連線（準備）

source: VPN connection %d
en: VPN 連線 %d

source: VPN connection failed
en: VPN 連線失敗

source: VPN disconnected
en: VPN 已離線

source: Valid connection types: %s
en: 有效的連線類型：%s

source: Validate
en: Välideit

source: Validation results
en: Välideiçion risùlts

source: Variable '%s' at %L has not been assigned a format label
en: 變數「%s」在 %L 尚未指派到格式標籤

source: Variable type is UNKNOWN in assignment at %L
en: %L 處賦值中的變數類型是 UNKNOWN

source: Verify connection: %s
en: 驗證連線：%s

source: Verify setting '%s': %s
en: 驗證設定「%s」：%s

source: Version %s
en: Vörçion %s

source: Version Comparisons
en: 版本比對

source: Version Control
en: 版本控制

source: Version Status
en: 版本狀態

source: Version control comparison
en: 版本控制比對

source: Version control pane position
en: 版本控制狀態窗格位置

source: Version control status filters
en: 版本控制狀態過濾器

source: Version control view
en: 版本控制檢視

source: Version control:
en: 版本控制：

source: View Log
en: Vyu Log

source: View log
en: Vyu log

source: View the comparison in fullscreen
en: 以全螢幕模式查看比對

source: Visible Columns
en: 可見欄位

source: WEP 128-bit Passphrase
en: WEP 128 位元的密碼字串

source: WEP 40/128-bit Key (Hex or ASCII)
en: WEP 40/128 位元的金鑰（Hex 或 ASCII）

source: WEP index
en: WEP 索引

source: WHERE/ELSEWHERE clause at %L requires a LOGICAL array
en: %L 處的 WHERE/ELSEWHERE 子句需要一個 LOGICAL 陣列

source: WPA & WPA2 Enterprise
en: WPA & WPA2 企業級

source: WPA & WPA2 Personal
en: WPA & WPA2 個人用

source: WPA Ad-Hoc authentication requires 'wpa' protocol
en: WPA Ad-Hoc身份驗證需要“wpa”協議

source: WPA Ad-Hoc authentication requires an Ad-Hoc mode AP
en: WPA Ad-Hoc身份驗證需要Ad-Hoc模式AP

source: WPA Ad-Hoc disabled due to kernel bugs
en: 由於內核錯誤，WPA Ad-Hoc被禁用

source: WPA Ad-Hoc requires 'tkip' group cipher
en: WPA Ad-Hoc需要'tkip'組密碼

source: WPA authentication is incompatible with Shared Key authentication
en: WPA身份驗證與共享密鑰身份驗證不兼容

source: WPA authentication is incompatible with non-EAP (original) LEAP or Dynamic WEP
en: WPA身份驗證與非EAP（原始）LEAP或動態WEP不兼容

source: WPA-EAP authentication requires an 802.1x setting
en: WPA-EAP身份驗證需要802.1x設置

source: WPA-PSK authentication is incompatible with 802.1x
en: WPA-PSK身份驗證與802.1x不兼容

source: WPAN connection
en: WPAN連接

source: WPAN settings
en: WPAN設置

source: WWAN radio switch
en: WWAN radio 開關

source: Waiting for authentication…
en: Weiting für òŧentikeiçion…

source: Waits for NetworkManager to finish activating startup network connections.
en: 等待 NetworkManager 完成啟用開啟網路連線。

source: Wake-on-LAN mode 'default' and 'ignore' are exclusive flags
en: 局域網喚醒模式'默認'和'忽略'是獨占標誌

source: Wake-on-LAN password can only be used with magic packet mode
en: 局域網喚醒密碼只能與魔術包模式一起使用

source: Wake-on-WLAN mode 'default' and 'ignore' are exclusive flags
en: 喚醒WLAN模式'default'和'ignore'是獨占標誌

source: Wake-on-WLAN trying to set unknown flag
en: 喚醒WLAN嘗試設置未知標誌

source: Warn about "extern" declarations not at file scope
en: 當「extern」宣告不在檔案作用欄位時給出警告

source: Warn about "suspicious" constructs
en: 對「可疑」的建構給出警告

source: Warn about @selector()s without previously declared methods
en: 當使用 @selector() 卻不作事先宣告時給出警告

source: Warn about all enumerated switches missing a specific case
en: 當使用列舉類型做為開關變數但又缺少某個 case 時給出警告

source: Warn about casting functions to incompatible types
en: 當把函式轉換為不相容類型時給出警告

source: Warn about casts which discard qualifiers
en: 當類型轉換丟失限定資訊時給出警告

source: Warn about compile-time integer division by zero
en: 對編譯時發現的零除給出警告

source: Warn about enumerated switches missing a "default:" statement
en: 當使用列舉類型做為開關變數，但沒有提供「default」分支時給出警告

source: Warn about enumerated switches, with no default, missing a case
en: 當使用列舉類型做為開關變數，沒有提供 default 分支，但又缺少某個 case 時給出警告

source: Warn about features not present in traditional C
en: 使用了傳統 C 不支援的特性時給出警告

source: Warn about function pointer arithmetic
en: 當在算術運算式中使用函式指標時給出警告

source: Warn about functions which might be candidates for format attributes
en: 當函式可能是 format 屬性的備選時給出警告

source: Warn about global functions without previous declarations
en: 當全域函式沒有前向宣告時給出警告

source: Warn about global functions without prototypes
en: 全域函式沒有原型時給出警告

source: Warn about implicit function declarations
en: 對隱含函式宣告給出警告

source: Warn about inappropriate attribute usage
en: 當對屬性的使用不合適時給出警告

source: Warn about invalid uses of the "offsetof" macro
en: 對「offsetof」巨集無效的使用給出警告

source: Warn about missing fields in struct initializers
en: 若結構初始值設定項中缺少欄位則給出警告

source: Warn about misuses of pragmas
en: 對錯誤使用的 pragma 加以警告

source: Warn about multiple declarations of the same object
en: 對同一個物件多次宣告時給出警告

source: Warn about non-virtual destructors
en: 當解構函式不是虛函式時給出警告

source: Warn about possible security problems with format functions
en: 當使用格式字串的函式可能導致安全問題時給出警告

source: Warn about possible violations of sequence point rules
en: 當可能違反定序點規則時給出警告

source: Warn about possibly missing braces around initializers
en: 若初始值設定項中可能缺少大括號則給出警告

source: Warn about possibly missing parentheses
en: 可能缺少括號的情況下給出警告

source: Warn about possibly nested block comments, and C++ comments spanning more than one physical line
en: 對可能巢狀的註釋和長度超過一個物理列長的 C++ 註釋給出警告

source: Warn about printf/scanf/strftime/strfmon format string anomalies
en: 對 printf/scanf/strftime/strfmon 中的格式字串異常給出警告

source: Warn about signed-unsigned comparisons
en: 在有號和無號數間進行比較時給出警告

source: Warn about strftime formats yielding 2-digit years
en: 當 strftime 格式給出 2 位記年時給出警告

source: Warn about suspicious declarations of "main"
en: 對可疑的「main」宣告給出警告

source: Warn about uncasted NULL used as sentinel
en: 將未作轉換的 NULL 做為哨兵時給出警告

source: Warn about underflow of numerical constant expressions
en: 數字常數運算式向下溢位時警告

source: Warn about unprototyped function declarations
en: 使用了非原型的函式宣告時給出莥警告

source: Warn about use of multi-character character constants
en: 使用多位元組字元集的字元常數時給出警告

source: Warn about user-specified include directories that do not exist
en: 當使用者給定的包含目錄不存在時給出警告

source: Warn about uses of __attribute__((deprecated)) declarations
en: 對 __attribute__((deprecated)) 宣告給出警告

source: Warn about zero-length formats
en: 對長度為 0 的格式字串給出警告

source: Warn if .class files are out of date
en: 當 .class 檔案已過時時給出警告

source: Warn if a deprecated compiler feature, class, method, or field is used
en: 當使用過時的編譯器特性，類別，方法或欄位時給出警告

source: Warn if a function uses alloca or creates an array with dynamic size
en: 當函式使用 alloca 來建立彈性陣列時給出警告

source: Warn if a selector has multiple methods
en: 當選擇子有多個方法時給出警告

source: Warn if a single function's framesize exceeds the given framesize
en: 當單一函式的圖框大小超過給定值時給出警告

source: Warn if an old-style parameter definition is used
en: 使用舊式參數定義時給出警告

source: Warn if an undefined macro is used in an #if directive
en: 當 #if 指令中用到未定義的巨集時給出警告

source: Warn if deprecated empty statements are found
en: 發現過時的空敘述時給出警告

source: Warn if inherited methods are unimplemented
en: 當繼承來的方法未被實作時給出警告

source: Warn if passing too many arguments to a function for its format string
en: 當傳遞給格式字串的引數太多時給出警告

source: Warn if testing floating point numbers for equality
en: 當比較浮點數是否相等時給出警告

source: Warn if the loop cannot be optimized due to nontrivial assumptions.
en: 當循環因為不平凡的假定而不能被最佳化時給出警告

source: Warn if trigraphs are encountered that might affect the meaning of the program
en: 當三字母序列可能影響程式意義時給出警告

source: Warn if type signatures of candidate methods do not match exactly
en: 當備選方法的類型簽字不完全匹配時給出警告

source: Warn when a declaration does not specify a type
en: 當宣告未指定類型時給出警告

source: Warn when a function is unused
en: 有未使用的函式時警告

source: Warn when a function parameter is unused
en: 發現未使用的函式指標時給出警告

source: Warn when a label is unused
en: 有未使用的標籤時警告

source: Warn when a pointer is cast to an integer of a different size
en: 當將一個指標轉換為大小不同的整數時給出警告

source: Warn when a register variable is declared volatile
en: 當一個暫存器變數被宣告為 volatile 時給出警告

source: Warn when a variable is unused
en: 有未使用的變數時警告

source: Warn when all constructors and destructors are private
en: 當所有建構式和解構函式都是私有時給出警告

source: Warn when an expression value is unused
en: 當一個運算式的值未被使用時給出警告

source: Warn when an inlined function cannot be inlined
en: 當內聯函式無法被內聯時給出警告

source: Warn when an optimization pass is disabled
en: 當某趟最佳化被停用時給出警告

source: Warn when converting the type of pointers to member functions
en: 當變更成員函式指標的類型時給出警告

source: Warn when non-templatized friend functions are declared within a template
en: 在範本內宣告未範本化的夥伴函式時給出警告

source: Warn when one local variable shadows another
en: 當一個局部變數掩蓋了另一個局部變數時給出警告

source: Warn when overload promotes from unsigned to signed
en: 當多載將無號數提升為有號數時給出警告

source: Warn when padding is required to align structure members
en: 當需要填補才能對齊結構成員時給出警告

source: Warn when the compiler reorders code
en: 編譯器將程式碼重新排序時給出警告

source: Warn when the packed attribute has no effect on struct layout
en: 當 packed 屬性對結構版面設置不起作用時給出警告

source: Warn when there is a cast to a pointer from an integer of a different size
en: 當將一個大小不同的整數轉換為指標時給出警告

source: Warn whenever a function's return type defaults to "int" (C), or about inconsistent return types (C++)
en: 當 C 函式的回傳值預設為「int」，或是 C++ 函式的回傳類型不一致時給出警告

source: Warn whenever an Objective-C assignment is being intercepted by the garbage collector
en: 當 Objective-C 賦值可能為無用回收所介入時給出警告

source: Warning:
en: 警告：

source: Warning: %s
en: 警告： %s

source: Warning: %s is not an UUID of any existing connection profile
en: 警告： %s 不是任何現有連接配置文件的UUID

source: Warning: %s.%s set to '%s', but it might be ignored in infrastructure mode
en: 警告： %s.%s 調成 '%s', 但在基礎架構模式下可能會被忽略

source: Warning: '%s' should be SSID for hidden APs; but it looks like a BSSID.
en: 警告： '%s' 應該是隱藏AP的SSID;但它看起來像一個BSSID。

source: Warning: 'file' already specified, ignoring extra one.
en: 警告：已經指定了'file'，忽略了額外的。

source: Warning: 'type' already specified, ignoring extra one.
en: 警告：已經指定'type'，忽略額外的一個。

source: Warning: argument '%s' is duplicated.
en: 警告：參數'%s' 是重複的。

source: Warning: editing existing connection '%s'; 'con-name' argument is ignored
en: 警告：正要編輯既有的連線「%s」；「con-name」引數已忽略

source: Warning: editing existing connection '%s'; 'type' argument is ignored
en: 警告：正要編輯既有的連線「%s」；「type」引數已忽略

source: Warning: master='%s' doesn't refer to any existing profile.
en: 警告：master ='%s' 沒有引用任何現有的個人資料。

source: Warning: password for '%s' not given in 'passwd-file' and nmcli cannot ask without '--ask' option.
en: 警告：'密碼'%s' 未在'passwd-file'中給出，並且nmcli不能在沒有'--ask'選項的情況下詢問。

source: Warning: setting %s.%s requires removing ipv4 and ipv6 settings
en: 警告：設置 %s.%s 需要刪除ipv4和ipv6設置

source: Website
en: 網站

source: Welcome to Poedit
en: Welkom tu Poedit

source: What is Crowdin?
en: Crowdin-wa myenigga?

source: When "method" is set to "auto" and this property to TRUE, automatically configured nameservers and search domains are ignored and only nameservers and search domains specified in the "dns" and "dns-search" properties, if any, are used.
en: 當“method”設置為“auto”且此屬性為TRUE時，將忽略自動配置的名稱服務器和搜索域，並且僅使用“dns”和“dns-search”屬性中指定的名稱服務器和搜索域（如果有）。

source: When "method" is set to "auto" and this property to TRUE, automatically configured routes are ignored and only routes specified in the "routes" property, if any, are used.
en: 當“method”設置為“auto”且此屬性為TRUE時，將忽略自動配置的路由，並且僅使用“routes”屬性中指定的路由（如果有）。

source: When "signed" or "unsigned" is not given make the bitfield signed
en: 沒有給定「signed」或「unsigned」時將位元段視作有號的

source: When "signed" or "unsigned" is not given make the bitfield unsigned
en: 未指定「signed」或「unsigned」時預設位元段為無號的

source: When TRUE, enforce auto-negotiation of speed and duplex mode. If "speed" and "duplex" properties are both specified, only that single mode will be advertised and accepted during the link auto-negotiation process: this works only for BASE-T 802.3 specifications and is useful for enforcing gigabits modes, as in these cases link negotiation is mandatory. When FALSE, "speed" and "duplex" properties should be both set or link configuration will be skipped.
en: 如果為TRUE，則強制執行速度和雙工模式的自動協商。如果同時指定了“速度”和“雙工”屬性，則在鏈接自動協商過程中只會公佈和接受該單一模式：這僅適用於BASE-T 802.3規範，對於實施千兆位模式非常有用，如案例鏈接協商是強制性的。如果為FALSE，則應同時設置“speed”和“duplex”屬性，否則將跳過鏈接配置。

source: When TRUE, only connections to the home network will be allowed. Connections to roaming networks will not be made.
en: 如果為TRUE，則僅允許連接到家庭網絡。不會與漫遊網絡建立連接。

source: When TRUE, overrides the "ca-path" and "phase2-ca-path" properties using the system CA directory specified at configure time with the --system-ca-path switch. The certificates in this directory are added to the verification chain in addition to any certificates specified by the "ca-cert" and "phase2-ca-cert" properties. If the path provided with --system-ca-path is rather a file name (bundle of trusted CA certificates), it overrides "ca-cert" and "phase2-ca-cert" properties instead (sets ca_cert/ca_cert2 options for wpa_supplicant).
en: 如果為TRUE，則使用--system-ca-path開關在配置時指定的系統CA目錄覆蓋“ca-path”和“phase2-ca-path”屬性。除了“ca-cert”和“phase2-ca-cert”屬性指定的任何證書之外，此目錄中的證書還將添加到驗證鏈中。如果--system-ca-path提供的路徑是文件名（可信CA證書包），則它會覆蓋“ca-cert”和“phase2-ca-cert”屬性（為wpa_supplicant設置ca_cert / ca_cert2選項） ）。

source: When WEP is used (ie, key-mgmt = "none" or "ieee8021x") indicate the 802.11 authentication algorithm required by the AP here. One of "open" for Open System, "shared" for Shared Key, or "leap" for Cisco LEAP. When using Cisco LEAP (ie, key-mgmt = "ieee8021x" and auth-alg = "leap") the "leap-username" and "leap-password" properties must be specified.
en: 當使用WEP（即，key-mgmt =“none”或“ieee8021x”）時，指示AP所需的802.11認證算法。開放系統的“開放”之一，共享密鑰“共享”，或思科LEAP的“飛躍”。使用Cisco LEAP（即key-mgmt =“ieee8021x”和auth-alg =“leap”）時，必須指定“leap-username”和“leap-password”屬性。

source: When a value grater than 0 is set, configures the device to use the specified speed. If "auto-negotiate" is "yes" the specified speed will be the only one advertised during link negotiation: this works only for BASE-T 802.3 specifications and is useful for enforcing gigabit speeds, as in this case link negotiation is mandatory. If the value is unset (0, the default), the link configuration will be either skipped (if "auto-negotiate" is "no", the default) or will be auto-negotiated (if "auto-negotiate" is "yes") and the local device will advertise all the supported speeds. In Mbit/s, ie 100 == 100Mbit/s. Must be set together with the "duplex" property when non-zero. Before specifying a speed value be sure your device supports it.
en: 設置大於0的值時，將設備配置為使用指定的速度。如果“自動協商”為“是”，則指定的速度將是鏈路協商期間通告的唯一速度：這僅適用於BASE-T 802.3規範，對於實施千兆位速度非常有用，因為在這種情況下，鏈路協商是強制性的。如果該值未設置（0，默認值），將跳過鏈接配置（如果“自動協商”為“否”，默認值）或將自動協商（如果“自動協商”為“是”） “）並且本地設備將通告所有支持的速度。在Mbit / s，即100 == 100Mbit / s。當非零時，必須與“duplex”屬性一起設置。在指定速度值之前，請確保您的設備支持它。

source: When a value is set, either "half" or "full", configures the device to use the specified duplex mode. If "auto-negotiate" is "yes" the specified duplex mode will be the only one advertised during link negotiation: this works only for BASE-T 802.3 specifications and is useful for enforcing gigabits modes, as in these cases link negotiation is mandatory. If the value is unset (the default), the link configuration will be either skipped (if "auto-negotiate" is "no", the default) or will be auto-negotiated (if "auto-negotiate" is "yes") and the local device will advertise all the supported duplex modes. Must be set together with the "speed" property if specified. Before specifying a duplex mode be sure your device supports it.
en: 設置值（“half”或“full”）時，將設備配置為使用指定的雙工模式。如果“自動協商”為“是”，則指定的雙工模式將是鏈路協商期間通告的唯一模式：這僅適用於BASE-T 802.3規範，對於實施千兆位模式非常有用，因為在這些情況下，鏈路協商是必需的。如果該值未設置（默認值），將跳過鏈接配置（如果“自動協商”為“否”，默認值）或將自動協商（如果“自動協商”為“是”）本地設備將通告所有支持的雙工模式。如果指定，必須與“speed”屬性一起設置。在指定雙工模式之前，請確保您的設備支持它。

source: When comparing based on mtime, this is the minimum difference in nanoseconds between two files before they’re considered to have different mtimes. This is useful when comparing files between filesystems with different timestamp resolution.
en: 當基於 mtime 進行比對時，兩個檔案至少要差異到奈秒以上，才會被認為 mtime 有差異。這在比對具有不同時間戳記精細度的檔案系統之間的檔案時非常有用。

source: When performing directory comparisons, you may filter out files and directories by name. Each pattern is a list of shell style wildcards separated by spaces.
en: 當進行資料夾比對時，您可以使用名稱把某些檔案及資料夾過濾掉。每個比對式樣都是 shell 形式的萬用字元清單，以空格分開。

source: When performing file comparisons, you may ignore certain types of changes. Each pattern here is a python regular expression which replaces matching text with the empty string before comparison is performed. If the expression contains groups, only the groups are replaced. See the user manual for more details.
en: 當進行檔案比對時，您可以忽略某種形式的變更。在這裡每個比對式樣都是 python 語言的正規表示式，會在進行比對前以空字串取代符合的文字。如果表示式包含群組，那麼只有群組會被取代。請參閱幫助手冊以取得更多資訊。

source: When possible do not generate stack frames
en: 盡可能不產生堆疊框架

source: When running CSE, follow jumps to their targets
en: 進行 CSE 時，跟隨跳轉至目的

source: When static WEP is used (ie, key-mgmt = "none") and a non-default WEP key index is used by the AP, put that WEP key index here. Valid values are 0 (default key) through 3. Note that some consumer access points (like the Linksys WRT54G) number the keys 1 - 4.
en: 當使用靜態WEP（即，key-mgmt =“none”）並且AP使用非默認WEP密鑰索引時，將該WEP密鑰索引放在此處。有效值為0（默認密鑰）到3.請注意，某些使用者訪問點（如Linksys WRT54G）將密鑰編號為1 - 4。

source: Whether DHCPv4 must be successful
en: DHCPv4是否必須成功

source: Whether LLDP is enabled for the connection.
en: 是否為連接啟用了LLDP。

source: Whether Link-Local Multicast Name Resolution (LLMNR) is enabled for the connection. LLMNR is a protocol based on the Domain Name System (DNS) packet format that allows both IPv4 and IPv6 hosts to perform name resolution for hosts on the same local link. The permitted values are: yes: register hostname and resolving for the connection, no: disable LLMNR for the interface, resolve: do not register hostname but allow resolving of LLMNR host names. This feature requires a plugin which supports LLMNR. One such plugin is dns-systemd-resolved.
en: 是否為連接啟用了鏈路本地多播名稱解析（LLMNR）。 LLMNR是一種基於域名系統（DNS）數據包格式的協議，允許IPv4和IPv6主機對同一本地鏈路上的主機執行名稱解析。允許的值為：yes：註冊主機名並解析連接，no：禁用接口的LLMNR，解決：不註冊主機名但允許解析LLMNR主機名。此功能需要一個支持LLMNR的插件。一個這樣的插件是dns-systemd-resolved。

source: Whether SLAAC must be successful
en: SLAAC是否必須成功

source: Whether mDNS is enabled for the connection. The permitted values are: yes: register hostname and resolving for the connection, no: disable mDNS for the interface, resolve: do not register hostname but allow resolving of mDNS host names. This feature requires a plugin which supports mDNS. One such plugin is dns-systemd-resolved.
en: 是否為連接啟用了mDNS。允許的值為：yes：註冊主機名並解析連接，no：禁用接口的mDNS，解決：不註冊主機名但允許解析mDNS主機名。此功能需要一個支持mDNS的插件。一個這樣的插件是dns-systemd-resolved。

source: Whether or not slaves of this connection should be automatically brought up when NetworkManager activates this connection. This only has a real effect for master connections. The properties "autoconnect", "autoconnect-priority" and "autoconnect-retries" are unrelated to this setting. The permitted values are: 0: leave slave connections untouched, 1: activate all the slave connections with this connection, -1: default. If -1 (default) is set, global connection.autoconnect-slaves is read to determine the real value. If it is default as well, this fallbacks to 0.
en: 當NetworkManager激活此連接時，是否應自動啟動此連接的從站。這僅對主連接有實際影響。屬性“autoconnect”，“autoconnect-priority”和“autoconnect-retries”與此設置無關。允許的值為：0：保持從屬連接不變，1：使用此連接激活所有從屬連接，-1：默認。如果設置為-1（默認值），則讀取全局connection.autoconnect-slaves以確定實際值。如果它也是默認值，則回退到0。

source: Whether or not the connection should be automatically connected by NetworkManager when the resources for the connection are available. TRUE to automatically activate the connection, FALSE to require manual intervention to activate the connection. Note that autoconnect is not implemented for VPN profiles. See "secondaries" as an alternative to automatically connect VPN profiles.
en: 當連接資源可用時，NetworkManager是否應自動連接連接。 TRUE表示自動激活連接，FALSE表示需要手動干預才能激活連接。請注意，VPN配置文件未實現自動連接。請參閱“輔助設備”作為自動連接VPN配置文件的替代方法。

source: Whether the connection is metered. When updating this property on a currently activated connection, the change takes effect immediately.
en: 是否計量連接。在當前激活的連接上更新此屬性時，更改會立即生效。

source: Whether the interface should be a MACVTAP.
en: 接口是否應該是MACVTAP。

source: Whether the interface should be put in promiscuous mode.
en: 是否應將接口置於混雜模式。

source: Whether the proxy configuration is for browser only.
en: 代理配置是否僅適用於瀏覽器。

source: Whether the transmitted traffic must be encrypted.
en: 傳輸的流量是否必須加密。
